
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/NaokiYazawa/bined-infra/actions/runs/5707319538)



<pre><code>Apply complete! Resources: 1 added, 1 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.ecs.data.aws_iam_policy.ecs_task_execution_role_policy: Reading...
module.alb.aws_s3_bucket.alb_log: Refreshing state... [id=bined-hasura-alb-log-bucket]
module.ecs.module.ecs_task_execution_role.data.aws_iam_policy_document.assume_role: Reading...
module.network.aws_vpc.this[0]: Refreshing state... [id=vpc-0a20ed93f94539036]
module.alb.data.aws_elb_service_account.main: Reading...
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=bined-hasura-20230730144634945400000001]
module.ecs.aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:761817748648:cluster/bined-hasura]
module.ecs.aws_cloudwatch_log_group.cloudwatch_log_group: Refreshing state... [id=bined-hasura]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.module.ecs_task_execution_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1077804475]
module.alb.data.aws_elb_service_account.main: Read complete after 0s [id=582318560864]
module.ecs.module.ecs_task_execution_role.aws_iam_role.main: Refreshing state... [id=ecs-task-execution-role-name-dev]
module.ecs.data.aws_iam_policy.ecs_task_execution_role_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.ecs.data.aws_iam_policy_document.ecs_task_execution: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_execution: Read complete after 0s [id=3108874331]
module.ecs.module.ecs_task_execution_role.aws_iam_policy.main: Refreshing state... [id=arn:aws:iam::761817748648:policy/ecs-task-execution-role-name-dev]
module.ecs.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=bined-hasura]
module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.main: Refreshing state... [id=ecs-task-execution-role-name-dev-20230730160610736800000001]
module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-0f0bc25f4fe692b9f]
module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-04e257e755c87b631]
module.network.aws_default_route_table.default[0]: Refreshing state... [id=rtb-05c8ef1ecd42c0a1c]
module.network.aws_default_security_group.this[0]: Refreshing state... [id=sg-0e49e03a5db24049b]
module.network.aws_default_network_acl.this[0]: Refreshing state... [id=acl-02f2e05642c4a4f10]
module.network.aws_subnet.public[1]: Refreshing state... [id=subnet-0824e210311fe3361]
module.network.aws_subnet.database[0]: Refreshing state... [id=subnet-06e0f4cbee44e1b7e]
module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-06e4b653ba82a0dbb]
module.network.aws_subnet.database[1]: Refreshing state... [id=subnet-012d2f4ea363148d7]
module.network.aws_route_table.public[0]: Refreshing state... [id=rtb-0100ed7567dfa4692]
module.network.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04d47fac8f245bf03]
module.security_groups.aws_security_group.rds: Refreshing state... [id=sg-083bcb1f25b19e7ec]
module.security_groups.aws_security_group.alb: Refreshing state... [id=sg-0ecb9e4d622873720]
module.network.aws_route_table.private[0]: Refreshing state... [id=rtb-0bb4120b65c92a107]
module.security_groups.aws_security_group.bastion: Refreshing state... [id=sg-0f8380f49f5c0ad42]
module.security_groups.aws_security_group.ecs: Refreshing state... [id=sg-0ff51e5c4d89f1d35]
module.network.aws_db_subnet_group.database[0]: Refreshing state... [id=bined-hasura]
module.alb.data.aws_iam_policy_document.alb_log: Reading...
module.alb.aws_s3_bucket_lifecycle_configuration.alb_log: Refreshing state... [id=bined-hasura-alb-log-bucket]
module.alb.data.aws_iam_policy_document.alb_log: Read complete after 0s [id=1370340032]
module.alb.aws_s3_bucket_policy.alb_log: Refreshing state... [id=bined-hasura-alb-log-bucket]
module.network.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0dc75306fafe9d656]
module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ff62e3874f25450b]
module.network.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0100ed7567dfa46921080289494]
module.network.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0970af91d0fee328c]
module.security_groups.aws_security_group_rule.rds_from_bastion: Refreshing state... [id=sgrule-2433012620]
module.network.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c5f41ee2056851dc]
module.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09c3069fee8860280]
module.network.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-02aab784abc51b12a]
module.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e5ff3a153cc05fb7]
module.security_groups.aws_security_group_rule.rds_from_ecs: Refreshing state... [id=sgrule-3456404465]
module.security_groups.aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2400929530]
module.alb.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:loadbalancer/app/bined-hasura/a741a29df068794d]
module.network.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0dc82545eb07c4ac9]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-XXIT2TPBBUOXASROCVIPQMOYO4]
module.network.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0bb4120b65c92a1071080289494]
module.alb.aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener/app/bined-hasura/a741a29df068794d/1648e0df2c74c4a2]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/bined-hasura-alb-target-group/dd6db5e43b282fe2]
module.ecs.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:761817748648:service/bined-hasura/bined-hasura]
module.alb.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener-rule/app/bined-hasura/a741a29df068794d/1648e0df2c74c4a2/7a548c8ac7467aa0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-northeast-1:761817748648:service/bined-hasura/bined-hasura"
        name                               = "bined-hasura"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/bined-hasura:1" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.ecs_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "ecs_task_definition" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/bined-hasura:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/bined-hasura" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "bined-hasura"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "app"
                        }
                    }
                  - mountPoints      = []
                    name             = "bined-hasura"
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "bined-hasura" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
module.ecs.aws_ecs_task_definition.ecs_task_definition: Destroying... [id=bined-hasura]
module.ecs.aws_ecs_task_definition.ecs_task_definition: Destruction complete after 1s
module.ecs.aws_ecs_task_definition.ecs_task_definition: Creating...
module.ecs.aws_ecs_task_definition.ecs_task_definition: Creation complete after 0s [id=bined-hasura]
module.ecs.aws_ecs_service.ecs_service: Modifying... [id=arn:aws:ecs:ap-northeast-1:761817748648:service/bined-hasura/bined-hasura]
module.ecs.aws_ecs_service.ecs_service: Modifications complete after 1s [id=arn:aws:ecs:ap-northeast-1:761817748648:service/bined-hasura/bined-hasura]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 1 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":14,"Program":"tfcmt","SHA1":"8d29fbb335c01dd9570fd05b5bccffa2548fb64a","Vars":{},"WorkflowName":"Terraform"} -->